'use strict';

//--------------------------------------------------------------------------------
// 設定ファイルの読み込み
//--------------------------------------------------------------------------------
var path = require('../path.js');

//--------------------------------------------------------------------------------
// 設定のエクスポート
//--------------------------------------------------------------------------------
module.exports = {
    // 対象ファイル
    src: path.srcDir + path.sassDir + '**/*.scss',
    // 出力先
    dest: {
        build: path.buildDir + path.cssDir,
        release: path.releaseDir + path.cssDir
    },
    // AutoPrefixerの設定 
    autoprefixer: {
        browsers: [
            'last 2 versions',
            'ie >= 9',
            'iOS >= 7',
            'Android >= 4'
        ]
    }
};