'use strict';

//--------------------------------------------------------------------------------
// パッケージの読み込み
//--------------------------------------------------------------------------------
var gulp = require('gulp');
var browserSync = require('browser-sync');

//--------------------------------------------------------------------------------
// 設定ファイルの読み込み
//--------------------------------------------------------------------------------
var taskName = require('../taskName.js');

//--------------------------------------------------------------------------------
// タスクの登録
//--------------------------------------------------------------------------------
gulp.task(taskName.reload.normal, function () {
    browserSync.reload({
        once: true
    });
});

gulp.task(taskName.reload.stream, function () {
    browserSync.reload({
        once: true,
        stream: true
    });
});
